doc: streamline the docs
